bench-results/2016050101/01-etcdv3-snappy-result.log
nohup: ignoring input

2016/05/02 05:33:30 Step 1: starting databases...
2016/05/02 05:33:30 [0] Start etcdv3 at 10.240.0.21:3500
2016/05/02 05:33:30 [0] Response from 10.240.0.21:3500 (success:true )
2016/05/02 05:33:31 [1] Start etcdv3 at 10.240.0.22:3500
2016/05/02 05:33:31 [1] Response from 10.240.0.22:3500 (success:true )
2016/05/02 05:33:32 [2] Start etcdv3 at 10.240.0.23:3500
2016/05/02 05:33:32 [2] Response from 10.240.0.23:3500 (success:true )

2016/05/02 05:33:38 Step 2: starting tests...
 0 / 2000 B                                                                                  !   0.00%2016/05/02 05:33:38 finalize has started
 2000 / 2000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 24s

Summary:
  Total:	24.6769 secs.
  Slowest:	0.0359 secs.
  Fastest:	0.0088 secs.
  Average:	0.0123 secs.
  Stddev:	0.0050 secs.
  Requests/sec:	81.0474

Response time histogram:
  0.009 [1]	|
  0.012 [1437]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.014 [335]	|∎∎∎∎∎∎∎∎∎
  0.017 [27]	|
  0.020 [7]	|
  0.022 [23]	|
  0.025 [38]	|∎
  0.028 [57]	|∎
  0.031 [42]	|∎
  0.033 [23]	|
  0.036 [10]	|

Latency distribution:
  10% in 0.0096 secs.
  25% in 0.0100 secs.
  50% in 0.0107 secs.
  75% in 0.0117 secs.
  90% in 0.0171 secs.
  95% in 0.0268 secs.
  99% in 0.0312 secs.
unix_ts,avg_latency_ms,throughput
1462167218,12.909894,24
1462167219,12.030467,83
1462167220,11.705423,85
1462167221,11.907283,84
1462167222,12.233990,82
1462167223,12.308074,80
1462167224,12.219606,83
1462167225,12.145803,82
1462167226,12.735724,79
1462167227,12.145483,82
1462167228,12.246928,81
1462167229,12.091708,82
1462167230,12.186611,83
1462167231,11.982627,83
1462167232,12.012812,82
1462167233,12.085787,84
1462167234,11.918482,84
1462167235,12.114004,83
1462167236,12.427783,79
1462167237,12.969154,78
1462167238,13.444201,74
1462167239,12.746273,79
1462167240,12.138352,81
1462167241,13.447714,75
1462167242,12.794320,78
1462167243,12.361379,30

2016/05/02 05:34:03 time series saved... Uploading to Google cloud storage...
2016/05/02 05:34:03 Uploading timeseries.csv to 2016050101/01-etcdv3-snappy-timeseries.csv
UploadFile:

timeseries.csv
--->
2016050101/01-etcdv3-snappy-timeseries.csv


UploadFile Done!

2016/05/02 05:34:04 Uploading result.log to 2016050101/01-etcdv3-snappy-result.log
UploadFile:

result.log
--->
2016050101/01-etcdv3-snappy-result.log